const Agreement = React.createClass({
    render : function(){
        return (
            <div className="agreement">
                <div>过往的经历既是成绩也是回忆，也终将成为先锋生长的力量，那是我们永远坚持下去的信念。创业维艰，有困惑、有迷茫、有泪水、有悲伤，但我们相信坚持的信念终会带给我们快乐、感动和阳光。正像那江河奔流不息，是因为它的坚持，无惧山川阻隔，才有百川成海之时；船舶扬帆，是因为它的坚持，无惧巨浪险滩，终有它停靠的港湾。</div>
                <div>过往的经历既是成绩也是回忆，也终将成为先锋生长的力量，那是我们永远坚持下去的信念。创业维艰，有困惑、有迷茫、有泪水、有悲伤，但我们相信坚持的信念终会带给我们快乐、感动和阳光。正像那江河奔流不息，是因为它的坚持，无惧山川阻隔，才有百川成海之时；船舶扬帆，是因为它的坚持，无惧巨浪险滩，终有它停靠的港湾。</div>
                <div>过往的经历既是成绩也是回忆，也终将成为先锋生长的力量，那是我们永远坚持下去的信念。创业维艰，有困惑、有迷茫、有泪水、有悲伤，但我们相信坚持的信念终会带给我们快乐、感动和阳光。正像那江河奔流不息，是因为它的坚持，无惧山川阻隔，才有百川成海之时；船舶扬帆，是因为它的坚持，无惧巨浪险滩，终有它停靠的港湾。</div>
            </div>
        )
    }
});

$FW.DOMReady(function() {
    ReactDOM.render(<Header title={"xxx借款服务协议"}/>, document.getElementById('header'));
    ReactDOM.render(<Agreement/>, document.getElementById('cnt'));
});
